#!/usr/bin/env python3

print("Входные данные ")

x = int(input())
y = int(input())

print("Выходные данные")
print(y // x)
print(y % x)