#!/usr/bin/env python3

print("Входные данные ")

x = int(input())

print("Выходные данные")
print((x // 60) %24 )
print(x % 60)