#!/usr/bin/env python3

print("Входные данные")

x = int(input())
y = int(input())

print("Выходные данные")
print((x*y)/2)