#!/usr/bin/env python3

print("Входные данные ")

x = int(input())
y = int(input())
z = int(input())
print("Выходные данные")
print(x + y + z)